geshuyong/test/BSP/STM32F4_SDIO_SD_Driver/STM32F4_SDIO_SD_Driver.c
#define SD_VOLTAGE_WINDOW_SD            ((uint32_t)0x80100000)
#define SD_HIGH_CAPACITY                ((uint32_t)0x40000000)
#define SD_STD_CAPACITY                 ((uint32_t)0x00000000)
#define SD_CHECK_PATTERN                ((uint32_t)0x000001AA)

#define SD_MAX_VOLT_TRIAL               ((uint32_t)0x0000FFFF)
#define SD_ALLZERO                      ((uint32_t)0x00000000)

#define SD_WIDE_BUS_SUPPORT             ((uint32_t)0x00040000)
#define SD_SINGLE_BUS_SUPPORT           ((uint32_t)0x00010000)
#define SD_CARD_LOCKED                  ((uint32_t)0x02000000)

#define SD_DATATIMEOUT                  ((uint32_t)0xFFFFFFFF)
#define SD_0TO7BITS                     ((uint32_t)0x000000FF)
#define SD_8TO15BITS                    ((uint32_t)0x0000FF00)
#define SD_16TO23BITS                   ((uint32_t)0x00FF0000)
#define SD_24TO31BITS                   ((uint32_t)0xFF000000)
#define SD_MAX_DATA_LENGTH              ((uint32_t)0x01FFFFFF)

#define SD_HALFFIFO                     ((uint32_t)0x00000008)
#define SD_HALFFIFOBYTES                ((uint32_t)0x00000020)

/** 
  * @brief  Command Class Supported 
  */
#define SD_CCCC_LOCK_UNLOCK             ((uint32_t)0x00000080)
#define SD_CCCC_WRITE_PROT              ((uint32_t)0x00000040)
#define SD_CCCC_ERASE                   ((uint32_t)0x00000020)

/** 
  * @brief  Following commands are SD Card Specific commands.
  *         SDIO_APP_CMD should be sent before sending these commands. 
  */
#define SDIO_SEND_IF_COND               ((uint32_t)0x00000008)

/**
  * @}
  */ 

/** @defgroup STM324xG_EVAL_SDIO_SD_Private_Macros
  * @{
  */
/**
  * @}
  */ 

/** @defgroup STM324xG_EVAL_SDIO_SD_Private_Variables
  * @{
  */

static uint32_t CardType =  SDIO_STD_CAPACITY_SD_CARD_V1_1;	//存储卡的类型，先把它初始化为1.1协议的卡
static uint32_t CSD_Tab[4], CID_Tab[4], RCA = 0;			//存储CSD，DID，寄存器和卡相对地址
static uint8_t SDSTATUS_Tab[16];							//存储卡状态，是CSR的一部分
__IO uint32_t StopCondition = 0;							//用于停止卡操作的标志
__IO SD_Error TransferError = SD_OK;						//用于存储卡错误，初始化为正常状态
__IO uint32_t TransferEnd = 0, DMAEndOfTransfer = 0;		//用于标志传输是否结束，在中断服务函数中调用
SD_CardInfo SDCardInfo;										//用于存储卡的信息

SDIO_InitTypeDef 		SDIO_InitStructure;
SDIO_CmdInitTypeDef 	SDIO_CmdInitStructure;
SDIO_DataInitTypeDef 	SDIO_DataInitStructure;
/**
  * @}
  */ 


/** @defgroup STM324xG_EVAL_SDIO_SD_Private_Function_Prototypes
  * @{
  */
static SD_Error CmdError(void);
static SD_Error CmdResp1Error(uint8_t cmd);
static SD_Error CmdResp7Error(void);
static SD_Error CmdResp3Error(void);
static SD_Error CmdResp2Error(void);
static SD_Error CmdResp6Error(uint8_t cmd, uint16_t *prca);
static SD_Error SDEnWideBus(FunctionalState NewState);
static SD_Error IsCardProgramming(uint8_t *pstatus);
static SD_Error FindSCR(uint16_t rca, uint32_t *pscr);
uint8_t convert_from_bytes_to_power_of_two(uint16_t NumberOfBytes);
  
/**
  * @}
  */ 



/**
  * @brief  Initializes the SD Card and put it into StandBy State (Ready for data 
  *         transfer).
  * @param  None
  * @retval SD_Error: SD Card Error code.
  */
SD_Error SD_Init(void)
{
	__IO SD_Error errorstatus = SD_OK;

	/* SDIO外设初始化 */
	STM32F4_SDIO_Init();

	SDIO_DeInit();

	errorstatus = SD_PowerON();			//上电并进行卡识别流程，确认卡的操作电压

	if (errorstatus != SD_OK)
	{
		/*!< CMD Response TimeOut (wait for CMDSENT flag) */
		return(errorstatus);
	}

	errorstatus = SD_InitializeCards();	//初始化所有的卡或者单个卡进入就绪状态

	if (errorstatus != SD_OK)
	{
		/*!< CMD Response TimeOut (wait for CMDSENT flag) */
		return(errorstatus);
	}
	
	/*上电识别，卡初始化都完成后，进入数据传输模式，提高读写速度速度若超过24M要进入bypass模式	*/
	/*!< Configure the SDIO peripheral */
	/*!< SDIO_CK = SDIOCLK / (SDIO_TRANSFER_CLK_DIV + 2) */
	/*!< on STM32F4xx devices, SDIOCLK is fixed to 48MHz */
	SDIO_InitStructure.SDIO_ClockDiv 			= SDIO_TRANSFER_CLK_DIV;
	SDIO_InitStructure.SDIO_ClockEdge 			= SDIO_ClockEdge_Rising;
	SDIO_InitStructure.SDIO_ClockBypass 		= SDIO_ClockBypass_Disable;			//时钟频率若超过24M,要开启此模式
	SDIO_InitStructure.SDIO_ClockPowerSave 		= SDIO_ClockPowerSave_Disable;
	SDIO_InitStructure.SDIO_BusWide 			= SDIO_BusWide_1b;					//1位模式
	SDIO_InitStructure.SDIO_HardwareFlowControl = SDIO_HardwareFlowControl_Disable;	//硬件流，若开启，在FIFO不能进行发送和接收数据时，数据传输暂停
	SDIO_Init(&SDIO_InitStructure);

	/*----------------- Read CSD/CID MSD registers ------------------*/
	errorstatus = SD_GetCardInfo(&SDCardInfo);	//用来读取csd/cid寄存器

	if (errorstatus == SD_OK)
	{
		/*----------------- Select Card --------------------------------*/
		errorstatus = SD_SelectDeselect((uint32_t) (SDCardInfo.RCA << 16));//通过cmd7  ,rca选择要操作的卡
	}

	if (errorstatus == SD_OK)
	{
		errorstatus = SD_EnableWideBusOperation(SDIO_BusWide_4b);//开启4bits模式
	}  

	return(errorstatus);
}

/**
  * @brief  Gets the cuurent sd card data transfer status.
  * @param  None
  * @retval SDTransferState: Data Transfer state.
  *   This value can be: 
  *        - SD_TRANSFER_OK: No data transfer is acting
  *        - SD_TRANSFER_BUSY: Data transfer is acting
  */
SDTransferState SD_GetStatus(void)
{
	SDCardState cardstate =  SD_CARD_TRANSFER;

	cardstate = SD_GetState();

	if (cardstate == SD_CARD_TRANSFER)
	{
		return(SD_TRANSFER_OK);
	}
	else if(cardstate == SD_CARD_ERROR)
	{
		return (SD_TRANSFER_ERROR);
	}
	else
	{
		return(SD_TRANSFER_BUSY);
	}
}

/**
  * @brief  Returns the current card's state.
  * @param  None
  * @retval SDCardState: SD Card Error or SD Card Current State.
  */
SDCardState SD_GetState(void)
{
	uint32_t resp1 = 0;

	if (SD_SendStatus(&resp1) != SD_OK)
	{
		return SD_CARD_ERROR;
	}
	else
	{
		return (SDCardState)((resp1 >> 9) & 0x0F);
	}

}

/**
  * @brief  Enquires cards about their operating voltage and configures 
  *   clock controls.
  * @param  None
  * @retval SD_Error: SD Card Error code.
  */
SD_Error SD_PowerON(void)
{
	__IO SD_Error 	errorstatus = SD_OK;
	uint32_t 		response = 0, count = 0, validvoltage = 0;
	uint32_t 		SDType 	= SD_STD_CAPACITY;

	/*!< Power ON Sequence -----------------------------------------------------*/
	/*!< Configure the SDIO peripheral */
	/*!< SDIO_CK = SDIOCLK / (SDIO_INIT_CLK_DIV + 2) */
	/*!< on STM32F4xx devices, SDIOCLK is fixed to 48MHz */
	/*!< SDIO_CK for initialization should not exceed 400 KHz */
	/*初始化时的时钟不能大于400KHz*/	
	SDIO_InitStructure.SDIO_ClockDiv 			= SDIO_INIT_CLK_DIV;
	SDIO_InitStructure.SDIO_ClockEdge	 		= SDIO_ClockEdge_Rising;
	SDIO_InitStructure.SDIO_ClockBypass 		= SDIO_ClockBypass_Disable;
	SDIO_InitStructure.SDIO_ClockPowerSave 		= SDIO_ClockPowerSave_Disable;
	SDIO_InitStructure.SDIO_BusWide 			= SDIO_BusWide_1b;
	SDIO_InitStructure.SDIO_HardwareFlowControl = SDIO_HardwareFlowControl_Disable;
	SDIO_Init(&SDIO_InitStructure);

	/*!< Set Power State to ON */
	SDIO_SetPowerState(SDIO_PowerState_ON);

	/*!< Enable SDIO Clock */
	SDIO_ClockCmd(ENABLE);

